БИТУправление_медицинским_центром_демо/src/Catalogs/ВидыВремениГрафика/ВидыВремениГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыВремениГрафика</name>
  <predefined>
    <items>
      <name>РабочееВремя</name>
      <description>Рабочее время</description>
    </items>
  </predefined>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееВремяТабеля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ВидыВремениГрафика/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	об = РеквизитФормыВЗначение("Объект");
	ВыбранныйЦвет = об.Цвет.Получить();
	
	Элементы.ВыбранныйЦвет.Доступность = Объект.Ссылка <> Справочники.ВидыВремениГрафика.РабочееВремя;
	Элементы.РабочееВремяТабеля.Доступность = Не Объект.РабочееВремя;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Цвет = Новый ХранилищеЗначения(ВыбранныйЦвет);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РабочееВремяПриИзменении(Элемент)
	
	Если Объект.РабочееВремя Тогда
		Объект.РабочееВремяТабеля = Истина;
	КонецЕсли;
	
	Элементы.РабочееВремяТабеля.Доступность = Не Объект.РабочееВремя;
	
КонецПроцедуры

#КонецОбласти
